000100120528      /if not defined(CPARSEFACT)
000101120528      /define CPARSEFACT
000102120528
000103120528     d CPARSEFACT_getParser...
000105120528     d                 pr              *   procptr
000106120528     d fileType                      10a   const varying
000107120528
000108120528      /endif
